radwaa6/Master_Embeded_System_diploma/Stm32_F103C6_Drivers/Inc/CAN.h
/*
 * CAN.h
 *
 *  Created on: Jan 28, 2025
 *      Author: Laptix
 */

#ifndef CAN_CAN_H_
#define CAN_CAN_H_

/* Includes ------------------------------------------------------------------*/
#include "stm32f103x6.h"
// Ensure that CAN_BIT_FIELD.h is correctly named and available in your project

#include <stm32_F103C6_gpio_driver.h>
#include <stdint.h>

#define CAN1_RX0_IRQ		20
#define CAN1_RX1_IRQ		21

#define CAN1_TX_IRQ			19
#define CAN1_SCE_IRQ		22
/* Macros to enable NVIC interrupts for CAN */
#define NVIC_IRQ19_CAN1_TX_Enable()     (NVIC_ISER0 |= (1 << 19))
#define NVIC_IRQ20_CAN1_RX0_Enable()    (NVIC_ISER0 |= (1 << 20))
#define NVIC_IRQ21_CAN1_RX1_Enable()    (NVIC_ISER0 |= (1 << 21))
#define NVIC_IRQ22_CAN1_SCE_Enable()    (NVIC_ISER0 |= (1 << 22))

/* Macros to disable NVIC interrupts for CAN */
#define NVIC_IRQ19_CAN1_TX_Disable()    (NVIC_ICER0 |= (1 << 19))
#define NVIC_IRQ20_CAN1_RX0_Disable()   (NVIC_ICER0 |= (1 << 20))
#define NVIC_IRQ21_CAN1_RX1_Disable()   (NVIC_ICER0 |= (1 << 21))
#define NVIC_IRQ22_CAN1_SCE_Disable()   (NVIC_ICER0 |= (1 << 22))
#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))
#define __STATIC_FORCEINLINE                   __attribute__((always_inline)) static inline
#define __ASM                                  __asm
#define PERIPH_BASE           0x40000000UL
#define APB1PERIPH_BASE       PERIPH_BASE
#define CAN1_BASE             (APB1PERIPH_BASE + 0x00006400UL)
//Structure definition for CAN register
typedef struct
{
	volatile uint32_t TIR;
	volatile uint32_t TDTR;
	volatile uint32_t TDLR;
	volatile uint32_t TDHR;
} CAN_TxMailBox_TypeDef;
typedef struct
{
	volatile uint32_t FR1;
	volatile uint32_t FR2;
} CAN_FilterRegister_TypeDef;
typedef struct
{
	volatile uint32_t RIR;
	volatile uint32_t RDTR;
	volatile uint32_t RDLR;
	volatile uint32_t RDHR;
} CAN_FIFOMailBox_TypeDef;
typedef struct
{
	volatile uint32_t MCR;
	volatile uint32_t MSR;
	volatile uint32_t TSR;
	volatile uint32_t RF0R;
	volatile uint32_t RF1R;
	volatile uint32_t IER;
	volatile uint32_t ESR;
	volatile uint32_t BTR;
  uint32_t  RESERVED0[88];
  CAN_TxMailBox_TypeDef sTxMailBox[3];
  CAN_FIFOMailBox_TypeDef sFIFOMailBox[2];
  uint32_t  RESERVED1[12];
  volatile uint32_t FMR;
  volatile uint32_t FM1R;
  uint32_t  RESERVED2;
  volatile uint32_t FS1R;
  uint32_t  RESERVED3;
  volatile uint32_t FFA1R;
  uint32_t  RESERVED4;
  volatile uint32_t FA1R;
  uint32_t  RESERVED5[8];
  CAN_FilterRegister_TypeDef sFilterRegister[14];
} CAN_TypeDef;
// Base address for FLASH
#define FLASH_BASE               0x40022000UL

// Structure definition for FLASH registers
typedef struct {
    volatile uint32_t ACR;     // Flash access control register
    volatile uint32_t KEYR;    // Flash key register
    volatile uint32_t OPTKEYR; // Flash option key register
    volatile uint32_t SR;      // Flash status register
    volatile uint32_t CR;      // Flash control register
    volatile uint32_t AR;      // Flash address register
    volatile uint32_t RESERVED; // Reserved
    volatile uint32_t OBR;      // Flash option byte register
    volatile uint32_t WRPR;     // Flash write protection register
} FLASH_TypeDef;

// FLASH Peripheral Instance
#define FLASH                   ((FLASH_TypeDef *)FLASH_BASE)
#define CAN1                ((CAN_TypeDef *)CAN1_BASE)
// Enable clock for CAN1
#define RCC_CAN1_CLK_EN()			(RCC->APB1ENR |= 1<<25)
// Reset CAN1 peripheral
#define RCC_CAN1_Reset()			(RCC->APB1RSTR |= 1<<25)

__STATIC_FORCEINLINE uint32_t __RBIT(uint32_t value)
{
  uint32_t result;

#if ((defined (__ARM_ARCH_7M__      ) && (__ARM_ARCH_7M__      == 1)) || \
     (defined (__ARM_ARCH_7EM__     ) && (__ARM_ARCH_7EM__     == 1)) || \
     (defined (__ARM_ARCH_8M_MAIN__ ) && (__ARM_ARCH_8M_MAIN__ == 1))    )
   __ASM volatile ("rbit %0, %1" : "=r" (result) : "r" (value) );
#else
  uint32_t s = (4U /*sizeof(v)*/ * 8U) - 1U; /* extra shift needed at end */

  result = value;                      /* r will be reversed bits of v; first get LSB of v */
  for (value >>= 1U; value != 0U; value >>= 1U)
  {
    result <<= 1U;
    result |= value & 1U;
    s--;
  }
  result <<= s;                        /* shift when v's highest bits are zero */
#endif
  return result;
}
#define __CLZ             (uint8_t)__builtin_clz

#define POSITION_VAL(VAL)     (__CLZ(__RBIT(VAL)))
#define __weak   __attribute__((weak))
#define __STATIC_FORCEINLINE                   __attribute__((always_inline)) static inline

__STATIC_FORCEINLINE void __disable_irq(void)
{
  __ASM volatile ("cpsid i" : : : "memory");
}

/** @addtogroup STM32F1xx_HAL_Driver
  * @{
  */

/** @addtogroup CAN
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup CAN_Exported_Types CAN Exported Types
  * @{
  */

/**
  * @brief  HAL State structures definition
  */
typedef enum
{
  HAL_CAN_STATE_RESET             = 0x00U,  /*!< CAN not yet initialized or disabled */
  HAL_CAN_STATE_READY             = 0x01U,  /*!< CAN initialized and ready for use   */
  HAL_CAN_STATE_LISTENING         = 0x02U,  /*!< CAN receive process is ongoing      */
  HAL_CAN_STATE_SLEEP_PENDING     = 0x03U,  /*!< CAN sleep request is pending        */
  HAL_CAN_STATE_SLEEP_ACTIVE      = 0x04U,  /*!< CAN sleep mode is active            */
  HAL_CAN_STATE_ERROR             = 0x05U   /*!< CAN error state                     */

} HAL_CAN_StateTypeDef;
typedef enum
{
  HAL_OK       = 0x00U,
  HAL_ERROR    = 0x01U,
  HAL_BUSY     = 0x02U,
  HAL_TIMEOUT  = 0x03U
} HAL_StatusTypeDef;
