radwaa6/Master_Embeded_System_diploma/Stm32_F103C6_Drivers/Inc/CAN.h
  uint32_t DLC;      /*!< Specifies the length of the frame that will be transmitted.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 8. */

  FunctionalState TransmitGlobalTime; /*!< Specifies whether the timestamp counter value captured on start
                        of frame transmission, is sent in DATA6 and DATA7 replacing pData[6] and pData[7].
                        @note: Time Triggered Communication Mode must be enabled.
                        @note: DLC must be programmed as 8 bytes, in order these 2 bytes are sent.
                        This parameter can be set to ENABLE or DISABLE. */

} CAN_TxHeaderTypeDef;

/**
  * @brief  CAN Rx message header structure definition
  */
typedef struct
{
  uint32_t StdId;    /*!< Specifies the standard identifier.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 0x7FF. */

  uint32_t ExtId;    /*!< Specifies the extended identifier.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 0x1FFFFFFF. */

  uint32_t IDE;      /*!< Specifies the type of identifier for the message that will be transmitted.
                        This parameter can be a value of @ref CAN_identifier_type */

  uint32_t RTR;      /*!< Specifies the type of frame for the message that will be transmitted.
                        This parameter can be a value of @ref CAN_remote_transmission_request */

  uint32_t DLC;      /*!< Specifies the length of the frame that will be transmitted.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 8. */

  uint32_t Timestamp; /*!< Specifies the timestamp counter value captured on start of frame reception.
                        @note: Time Triggered Communication Mode must be enabled.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 0xFFFF. */

  uint32_t FilterMatchIndex; /*!< Specifies the index of matching acceptance filter element.
                        This parameter must be a number between Min_Data = 0 and Max_Data = 0xFF. */

} CAN_RxHeaderTypeDef;

/**
  * @brief  CAN handle Structure definition
  */
#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
typedef struct __CAN_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
{
  CAN_TypeDef                 *Instance;                 /*!< Register base address */

  CAN_InitTypeDef             Init;                      /*!< CAN required parameters */

  volatile HAL_CAN_StateTypeDef   State;                     /*!< CAN communication state */

  volatile uint32_t               ErrorCode;                 /*!< CAN Error code.
                                                              This parameter can be a value of @ref CAN_Error_Code */

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
  void (* TxMailbox0CompleteCallback)(struct __CAN_HandleTypeDef *hcan); /*!< CAN Tx Mailbox 0 complete callback */
  void (* TxMailbox1CompleteCallback)(struct __CAN_HandleTypeDef *hcan); /*!< CAN Tx Mailbox 1 complete callback */
  void (* TxMailbox2CompleteCallback)(struct __CAN_HandleTypeDef *hcan); /*!< CAN Tx Mailbox 2 complete callback */
  void (* TxMailbox0AbortCallback)(struct __CAN_HandleTypeDef *hcan);    /*!< CAN Tx Mailbox 0 abort callback    */
  void (* TxMailbox1AbortCallback)(struct __CAN_HandleTypeDef *hcan);    /*!< CAN Tx Mailbox 1 abort callback    */
  void (* TxMailbox2AbortCallback)(struct __CAN_HandleTypeDef *hcan);    /*!< CAN Tx Mailbox 2 abort callback    */
  void (* RxFifo0MsgPendingCallback)(struct __CAN_HandleTypeDef *hcan); /*!< CAN Rx FIFO 0 msg pending callback */
  void (* RxFifo0FullCallback)(struct __CAN_HandleTypeDef *hcan);        /*!< CAN Rx FIFO 0 full callback        */
  void (* RxFifo1MsgPendingCallback)(struct __CAN_HandleTypeDef *hcan); /*!< CAN Rx FIFO 1 msg pending callback */
  void (* RxFifo1FullCallback)(struct __CAN_HandleTypeDef *hcan);        /*!< CAN Rx FIFO 1 full callback        */
  void (* SleepCallback)(struct __CAN_HandleTypeDef *hcan);              /*!< CAN Sleep callback                 */
  void (* WakeUpFromRxMsgCallback)(struct __CAN_HandleTypeDef *hcan);    /*!< CAN Wake Up from Rx msg callback   */
  void (* ErrorCallback)(struct __CAN_HandleTypeDef *hcan);              /*!< CAN Error callback                 */

  void (* MspInitCallback)(struct __CAN_HandleTypeDef *hcan);            /*!< CAN Msp Init callback              */
  void (* MspDeInitCallback)(struct __CAN_HandleTypeDef *hcan);          /*!< CAN Msp DeInit callback            */

#endif /* (USE_HAL_CAN_REGISTER_CALLBACKS) */
}CAN_HandleTypeDef;


#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  HAL CAN common Callback ID enumeration definition
  */
typedef enum
{
  HAL_CAN_TX_MAILBOX0_COMPLETE_CB_ID       = 0x00U,    /*!< CAN Tx Mailbox 0 complete callback ID         */
  HAL_CAN_TX_MAILBOX1_COMPLETE_CB_ID       = 0x01U,    /*!< CAN Tx Mailbox 1 complete callback ID         */
  HAL_CAN_TX_MAILBOX2_COMPLETE_CB_ID       = 0x02U,    /*!< CAN Tx Mailbox 2 complete callback ID         */
  HAL_CAN_TX_MAILBOX0_ABORT_CB_ID          = 0x03U,    /*!< CAN Tx Mailbox 0 abort callback ID            */
  HAL_CAN_TX_MAILBOX1_ABORT_CB_ID          = 0x04U,    /*!< CAN Tx Mailbox 1 abort callback ID            */
  HAL_CAN_TX_MAILBOX2_ABORT_CB_ID          = 0x05U,    /*!< CAN Tx Mailbox 2 abort callback ID            */
  HAL_CAN_RX_FIFO0_MSG_PENDING_CB_ID       = 0x06U,    /*!< CAN Rx FIFO 0 message pending callback ID     */
  HAL_CAN_RX_FIFO0_FULL_CB_ID              = 0x07U,    /*!< CAN Rx FIFO 0 full callback ID                */
  HAL_CAN_RX_FIFO1_MSG_PENDING_CB_ID       = 0x08U,    /*!< CAN Rx FIFO 1 message pending callback ID     */
  HAL_CAN_RX_FIFO1_FULL_CB_ID              = 0x09U,    /*!< CAN Rx FIFO 1 full callback ID                */
  HAL_CAN_SLEEP_CB_ID                      = 0x0AU,    /*!< CAN Sleep callback ID                         */
  HAL_CAN_WAKEUP_FROM_RX_MSG_CB_ID         = 0x0BU,    /*!< CAN Wake Up from Rx msg callback ID          */
  HAL_CAN_ERROR_CB_ID                      = 0x0CU,    /*!< CAN Error callback ID                         */

